using System;

namespace LeetCode
{
    class SubstringNew
    {
        public string LongestSubstring(String s)
        {

            //局部变量**************************
            
            //局部变量**************************

            //特殊情况***********************
            if(s.Length == 0 || s.Length == 1)
            {
                result = s;
                goto jump;
            }
            //特殊情况***********************
            //*************************正常处理String********************************//
            
            //第一次下一位与 当前位相等 且与 前一位不相等的情况
            
            //第一次下一位与当前位不相等的情况
            
            //*************************正常处理String********************************//
            
            
            
            // 返回结果
            return result;
            // 返回结果
        }
    }
}